Revit 2024 API
TabbedDialogExtension Class
 Contains the information required to create and implement the behavior for the new tab inside the Revit options dialog.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public class TabbedDialogExtension
Visual Basic
Public Class TabbedDialogExtension
Visual C++
public ref class TabbedDialogExtension
Remarks
 Each page has an associated user interface control and the handlers of buttons Cancel, Restore Defaults and help can optionally be set. The size of the control is limited to 305 (height) x 288 (width) in physical pixels.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.TabbedDialogExtension
See Also
TabbedDialogExtension Members
Autodesk.Revit.UI Namespace